In [1]:
import pandas as pd
import numpy as np

In [2]:
file_path = "04-Pandas_Instructions_HeroesOfPymoli_Resources_purchase_data.csv"

In [3]:
purchase_data_df = pd.read_csv(file_path)

In [4]:
purchase_data_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [5]:
#display the total number of players (assuming they meant unique players)
total_ND = purchase_data_df['SN'].nunique()
total_ND

576

In [6]:
# Player Count:
# There are 576 unique SN (Screen Names) which indicates that there are:
# 576 players

In [7]:
clean_purchase_data_df = purchase_data_df.loc[:, ["Gender", "SN", "Age"]]
clean_purchase_data_df = clean_purchase_data_df.drop_duplicates()
clean_purchase_data_df.head()

  Gender             SN  Age
0   Male        Lisim78   20
1   Male    Lisovynya38   40
2   Male     Ithergue48   24
3   Male  Chamassasya86   24
4   Male      Iskosia90   23

In [8]:
# Run basic calculations to obtain number of unique items, average price, etc.
unique_items = purchase_data_df['Item ID'].nunique()
average_price = purchase_data_df['Price'].mean()
total_purchases = purchase_data_df['Purchase ID'].count()
total_revenue = purchase_data_df['Price'].sum()

In [9]:
Summary_Dictionary = {'unique_items':[unique_items], 'average_price':[average_price], 'total_purchases':[total_purchases], 'total_revenue':[total_revenue]}
pd.DataFrame(Summary_Dictionary)

   unique_items  average_price  total_purchases  total_revenue
0           183       3.050987              780        2379.77

In [10]:
# Number of unique items: 183
# Average price: $3.05
# Total number of purchases: 780
# Total revenue: $2,379.77

In [11]:
# Identify percentage and count of male players
# Identify percentage and count of female players
# Identify percentage and count of other/non-disclosed
variable = clean_purchase_data_df["Gender"].value_counts()
variable

Male                     484
Female                    81
Other / Non-Disclosed     11
Name: Gender, dtype: int64

In [12]:
# Variable is the value counts of different gender column variables in clean_purchase_data_df
# Male = 484
# Female = 81
# Other = 11

In [13]:
percentage = (variable/total_ND)*100
percentage

Male                     84.027778
Female                   14.062500
Other / Non-Disclosed     1.909722
Name: Gender, dtype: float64

In [14]:
# Percentage is the Variable divided by the corresponding values in total_df multiplied by 100

# Purchase Count - 84%.03
# Average Purchase Price - 14.06%
# Total Purchase Value - 1.91%

# Average Purchase Total per Person by Gender is the amount spent per person

In [15]:
amount_of_purchases_per_gender = purchase_data_df.groupby(['Gender']).count()['Price']
amount_of_purchases_per_gender

Gender
Female                   113
Male                     652
Other / Non-Disclosed     15
Name: Price, dtype: int64

In [16]:
average_purchases_per_gender = purchase_data_df.groupby(['Gender']).mean()['Price']
average_purchases_per_gender

Gender
Female                   3.203009
Male                     3.017853
Other / Non-Disclosed    3.346000
Name: Price, dtype: float64

In [17]:
total_amount_per_gender = purchase_data_df.groupby(['Gender']).sum()['Price']
total_amount_per_gender

Gender
Female                    361.94
Male                     1967.64
Other / Non-Disclosed      50.19
Name: Price, dtype: float64

In [18]:
female_average_purchase = total_amount_per_gender['Female'] / (amount_of_purchases_per_gender['Female'])
female_average_purchase

3.203008849557519

In [19]:
male_average_purchase = total_amount_per_gender['Male'] / (amount_of_purchases_per_gender['Male'])
male_average_purchase

3.0178527607361953

In [20]:
Other_average_purchase = total_amount_per_gender['Other / Non-Disclosed'] / (amount_of_purchases_per_gender['Other / Non-Disclosed'])
Other_average_purchase

3.3460000000000005

In [21]:
# Male average purchase amount = $3.02
# Female average purchase amount = $3.20
# Other average purchase amount = $3.35

In [22]:
avg_total_per_person_per_gender = total_amount_per_gender / variable
avg_total_per_person_per_gender

Female                   4.468395
Male                     4.065372
Other / Non-Disclosed    4.562727
dtype: float64

In [23]:
# The average female player paid $4.47
# The average male player paid $4.07
# The average Other player paid $4.56

In [102]:
# Establish bins for ages
# Categorize the existing players into the age bins
# Bintest equals a cut portion from the age column in the clean purchase data df, use created bins and labels
bins = [0, 9, 14, 19, 24, 29, 34, 39, 100]
labels = ['<10', '10-14', '15-19', '20-24', '25-29', '30-34', '34-40', '40+']
bintest = pd.cut(clean_purchase_data_df['Age'], bins, labels=labels)
bintest.head()

0    20-24
1      40+
2    20-24
3    20-24
4    20-24
Name: Age, dtype: category
Categories (8, object): [<10 < 10-14 < 15-19 < 20-24 < 25-29 < 30-34 < 34-40 < 40+]

In [25]:
# Use the values in bintest and count the total amount in correspoinding bin categories
# Calculate the numbers and percentages by age group
s1 = pd.cut(clean_purchase_data_df['Age'], bins=bins, labels=labels).value_counts()
s2 = (s1 / 576)*100

In [26]:
# Create a summary data frame to hold the results
summary_df = pd.DataFrame({'Total Count':s1, 'Percentage':s2})
summary_df

       Total Count  Percentage
20-24          258   44.791667
15-19          107   18.576389
25-29           77   13.368056
30-34           52    9.027778
34-40           31    5.381944
10-14           22    3.819444
<10             17    2.951389
40+             12    2.083333

In [27]:
# Display Age Demographics Table
summary_df = summary_df.sort_index()
summary_df

       Total Count  Percentage
<10             17    2.951389
10-14           22    3.819444
15-19          107   18.576389
20-24          258   44.791667
25-29           77   13.368056
30-34           52    9.027778
34-40           31    5.381944
40+             12    2.083333

In [28]:
type(summary_df)

pandas.core.frame.DataFrame

In [29]:
purchase_data_df.head()
# Bin the purchase_data data frame by age
# Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. in the table below
# Create a summary data frame to hold the results
# Optional: give the displayed data cleaner formatting
# Display the summary data frame

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [30]:
purchaseDF = purchase_data_df.loc[:, ["Purchase ID", "SN", "Age", "Item Name", "Price"]]
purchaseDF.head()

,Purchase ID,SN,Age,Item Name,Price
0,0,Lisim78,20,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Final Critic,4.88
3,3,Chamassasya86,24,Blindscythe,3.27
4,4,Iskosia90,23,Fury,1.44

In [31]:
newbin = pd.cut(purchaseDF['Age'], bins, labels=labels)
newbin.head()

0    20-24
1      40+
2    20-24
3    20-24
4    20-24
Name: Age, dtype: category
Categories (8, object): [<10 < 10-14 < 15-19 < 20-24 < 25-29 < 30-34 < 34-40 < 40+]

In [32]:
type(newbin)

pandas.core.series.Series

In [33]:
s3 = pd.cut(purchaseDF['Age'], bins=bins, labels=labels).value_counts()

In [34]:
# This series includes the totals of the age ranges in the bin
s3

20-24    365
15-19    136
25-29    101
30-34     73
34-40     41
10-14     28
<10       23
40+       13
Name: Age, dtype: int64

In [35]:
s3.sort_index()

<10       23
10-14     28
15-19    136
20-24    365
25-29    101
30-34     73
34-40     41
40+       13
Name: Age, dtype: int64

In [36]:
purchaseDF.head()

,Purchase ID,SN,Age,Item Name,Price
0,0,Lisim78,20,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Final Critic,4.88
3,3,Chamassasya86,24,Blindscythe,3.27
4,4,Iskosia90,23,Fury,1.44

In [37]:
purchase_data_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [38]:
everything_binned = pd.cut(purchase_data_df['Age'], bins, labels=labels)
everything_binned.head()
#Purchase ID', 'SN', 'Gender', 'Item ID', 'Item Name', 'Price'

0    20-24
1      40+
2    20-24
3    20-24
4    20-24
Name: Age, dtype: category
Categories (8, object): [<10 < 10-14 < 15-19 < 20-24 < 25-29 < 30-34 < 34-40 < 40+]

In [39]:
s1

20-24    258
15-19    107
25-29     77
30-34     52
34-40     31
10-14     22
<10       17
40+       12
Name: Age, dtype: int64

In [40]:
purchase_data_df['Age Ranges'] = pd.cut(purchase_data_df['Age'], bins, labels=labels)
purchase_data_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Ranges
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,20-24
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,40+
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-24
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24

In [41]:
#groupby and sum price in this bin

sorted_purchase_data_df = purchase_data_df.groupby(['Age Ranges'])['Price'].sum()

In [42]:
s2 = sorted_purchase_data_df

In [43]:
s2

Age Ranges
<10        77.13
10-14      82.78
15-19     412.89
20-24    1114.06
25-29     293.00
30-34     214.00
34-40     147.67
40+        38.24
Name: Price, dtype: float64

In [44]:
#sorted_purchase_data_df.merge(s1.to_frame(), left_index=True, right_index=True)

In [45]:
totals_df = pd.concat([s3, s2], axis=1)
totals_df

       Age    Price
10-14   28    82.78
15-19  136   412.89
20-24  365  1114.06
25-29  101   293.00
30-34   73   214.00
34-40   41   147.67
40+     13    38.24
<10     23    77.13

In [46]:
#Rename column
totals_df = totals_df.rename(index=str, columns={"Age": "Amount", "Price": "Total Price"})

In [47]:
totals_df

       Amount  Total Price
10-14      28        82.78
15-19     136       412.89
20-24     365      1114.06
25-29     101       293.00
30-34      73       214.00
34-40      41       147.67
40+        13        38.24
<10        23        77.13

In [48]:
s4 = totals_df['Total Price'] / totals_df['Amount']
s4

10-14    2.956429
15-19    3.035956
20-24    3.052219
25-29    2.900990
30-34    2.931507
34-40    3.601707
40+      2.941538
<10      3.353478
dtype: float64

In [49]:
#merge s4 into df
totals_df = totals_df.merge(s4.to_frame(), left_index=True, right_index=True)

In [50]:
# Rename DF
totals_df = totals_df.rename(index=str, columns={"Age": "Amount", "Price": "Total Price", "0" : "Average Purchase Price"})

In [51]:
# I couldn't figure out how to rename the "0" column which should read "Average Purchase Price"
totals_df

       Amount  Total Price         0
10-14      28        82.78  2.956429
15-19     136       412.89  3.035956
20-24     365      1114.06  3.052219
25-29     101       293.00  2.900990
30-34      73       214.00  2.931507
34-40      41       147.67  3.601707
40+        13        38.24  2.941538
<10        23        77.13  3.353478

In [52]:
# Find average total purchase per person (by age range)
s5 = s2 / s1
s5

10-14    3.762727
15-19    3.858785
20-24    4.318062
25-29    3.805195
30-34    4.115385
34-40    4.763548
40+      3.186667
<10      4.537059
dtype: float64

In [53]:
# Merge series into previous df and rename
totals_df = totals_df.merge(s5.to_frame(), left_index=True, right_index=True)
totals_df = totals_df.rename(index=str, columns={"Amount": "Purchase Count", "Total Price": "Total Purchase Value", "0_x" : "Average Purchase Price", "0_y": "Avg Total Purchase per Person"})

In [54]:
totals_df

,Purchase Count,Total Purchase Value,Average Purchase Price,Avg Total Purchase per Person
10-14,28,82.78,2.956429,3.762727
15-19,136,412.89,3.035956,3.858785
20-24,365,1114.06,3.052219,4.318062
25-29,101,293.00,2.900990,3.805195
30-34,73,214.00,2.931507,4.115385
34-40,41,147.67,3.601707,4.763548
40+,13,38.24,2.941538,3.186667
<10,23,77.13,3.353478,4.537059

In [55]:
purchase_data_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Ranges
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,20-24
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,40+
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-24
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24

In [70]:
# Find top 5 users who spent the most
totalspend = purchase_data_df[['SN','Price']].groupby(['SN'])['Price'].sum()
totalspend.sort_values(ascending=False).head()

SN
Lisosia93      18.96
Idastidru52    15.45
Chamjask73     13.83
Iral74         13.62
Iskadarya95    13.10
Name: Price, dtype: float64

In [72]:
# See how many individual purchases each user spent (ranked)
newtest = purchase_data_df[['SN','Item ID']].groupby(['SN'])['Item ID'].count()
newtest.sort_values(ascending=False).head()

SN
Lisosia93      5
Iral74         4
Idastidru52    4
Aina42         3
Iri67          3
Name: Item ID, dtype: int64

In [94]:
# Merge the two series' and create a dataframe with relevant data
whoknows = pd.concat([totalspend, newtest], axis=1)
whoknows.sort_values(by=['Price'], ascending=False).head()

             Price  Item ID
SN
Lisosia93    18.96        5
Idastidru52  15.45        4
Chamjask73   13.83        3
Iral74       13.62        4
Iskadarya95  13.10        3

In [107]:
avg_price = totalspend / newtest
avg_price.head()

SN
Adairialis76    2.28
Adastirin33     4.48
Aeda94          4.91
Aela59          4.32
Aelaria33       1.79
dtype: float64

In [115]:
top_spenders = whoknows.merge(avg_price.to_frame(), left_index=True, right_index=True)
top_spenders.head()

              Price  Item ID     0
SN
Adairialis76   2.28        1  2.28
Adastirin33    4.48        1  4.48
Aeda94         4.91        1  4.91
Aela59         4.32        1  4.32
Aelaria33      1.79        1  1.79

In [119]:
top_spenders.sort_values(by=['Price'], ascending=False).head()
#top_spenders.rename(index=str, columns={"SN": "SN", "Item ID": "Item ID", "0":"Average Purchase Price"}).head()
# Again, can't rename the column correctly - "0" should read: "Average purchas price"

             Price  Item ID         0
SN
Lisosia93    18.96        5  3.792000
Idastidru52  15.45        4  3.862500
Chamjask73   13.83        3  4.610000
Iral74       13.62        4  3.405000
Iskadarya95  13.10        3  4.366667

In [104]:
# Most popular items
# Retrieve the Item ID, Item Name, and Item Price columns